In [3]:
import pandas as pd 
import numpy as np

In [4]:
d={
    'A':[1,2,np.nan],
    'B':[1,np.nan,np.nan],
    'C':[2,1,3]
}

In [5]:
df=pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  1.0  2
1  2.0  NaN  1
2  NaN  NaN  3

In [7]:
df.dropna()

     A    B  C
0  1.0  1.0  2

In [8]:
 df.dropna(axis=0)

     A    B  C
0  1.0  1.0  2

In [9]:
df.dropna(2)

TypeError: DataFrame.dropna() takes 1 positional argument but 2 were given

In [10]:
df.dropna(axis=2)

ValueError: No axis named 2 for object type DataFrame

In [11]:
df.dropna(axis=1)

   C
0  2
1  1
2  3

In [12]:
df

     A    B  C
0  1.0  1.0  2
1  2.0  NaN  1
2  NaN  NaN  3

In [13]:
df.fillna(value=2)

     A    B  C
0  1.0  1.0  2
1  2.0  2.0  1
2  2.0  2.0  3

In [14]:
df=pd.DataFrame(d)

In [15]:
a=df['A'].fillna(value=df['A'].mean())

In [16]:
df

     A    B  C
0  1.0  1.0  2
1  2.0  NaN  1
2  NaN  NaN  3

In [17]:
a

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [18]:
df

     A    B  C
0  1.0  1.0  2
1  2.0  NaN  1
2  NaN  NaN  3

In [19]:
df=pd.DataFrame(d)

In [20]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

C:\Users\santh\AppData\Local\Temp\ipykernel_10224\1576873578.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(value=df['A'].mean(),inplace=True)

In [21]:
df

     A    B  C
0  1.0  1.0  2
1  2.0  NaN  1
2  1.5  NaN  3

In [22]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

C:\Users\santh\AppData\Local\Temp\ipykernel_10224\1576873578.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(value=df['A'].mean(),inplace=True)

In [23]:
df

     A    B  C
0  1.0  1.0  2
1  2.0  NaN  1
2  1.5  NaN  3

In [27]:
data={
    'Company':['Google','Google','Microsoft','Microsoft','FB','FB'],
    'Person':['Sooraj','Akash','Darwin','Sudar','Santhosh','Dani'],
    'Sales':[500,1000,6000,7000,900,1000]
}

In [28]:
df=pd.DataFrame(data)

In [29]:
df

     Company    Person  Sales
0     Google    Sooraj    500
1     Google     Akash   1000
2  Microsoft    Darwin   6000
3  Microsoft     Sudar   7000
4         FB  Santhosh    900
5         FB      Dani   1000

In [38]:
byComp=df.groupby('Company')

In [43]:
byComp.mean(numeric_only=True)

            Sales
Company
FB          950.0
Google      750.0
Microsoft  6500.0

In [44]:
byComp.sum()

                 Person  Sales
Company
FB         SanthoshDani   1900
Google      SoorajAkash   1500
Microsoft   DarwinSudar  13000

In [45]:
df

     Company    Person  Sales
0     Google    Sooraj    500
1     Google     Akash   1000
2  Microsoft    Darwin   6000
3  Microsoft     Sudar   7000
4         FB  Santhosh    900
5         FB      Dani   1000